app/controllers/api/v1/events_controller.rb

SELECT "events".* FROM "events"
---
def index
    @events = Event.all

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
def show
@event = Event.find(params[:id])